tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/0.orig/gas/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inletFuel
    {
        type            fixedValue;
        value           uniform (0 0.5 0);
    }

    inletAir
    {
        type            fixedValue;
        value           uniform (0 1.5 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    gas_to_solid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
